# Pandas DataFrames - Null Values

In [1]:
import numpy as np
import pandas as pd
d= {'A':[1,2, np.nan],
    'B':[5,np.nan, np.nan],
    'C':[1,2,3]
   }
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [2]:
df = pd.DataFrame(d)

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna() #axis=0

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [6]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [7]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
df.fillna("Null Values")

             A            B  C
0          1.0          5.0  1
1          2.0  Null Values  2
2  Null Values  Null Values  3

In [ ]:
df

In [ ]:
df

In [10]:
df['A'].fillna(value = df['A'].mean(),inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

# Pandas DataFrame -  Groupby

In [1]:
import numpy as np
import pandas as pd
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT','FB', 'FB'],
        'Person': ['Anu','Adhin','Diya', 'Rek','Viha','Krish'],
        'Sales':[200, 120,340, 124, 350, 650]
       }
df = pd.DataFrame(data)
df

  Company Person  Sales
0    GOOG    Anu    200
1    GOOG  Adhin    120
2    MSFT   Diya    340
3    MSFT    Rek    124
4      FB   Viha    350
5      FB  Krish    650

In [2]:
company_group = df.groupby("Company")
print(company_group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001A29C639370>

In [3]:
company_group.sum()

         Sales
Company
FB        1000
GOOG       320
MSFT       464

In [4]:
company_group.sum().loc['FB']

Sales    1000
Name: FB, dtype: int64

In [5]:
df.groupby("Company").sum().loc["FB"]

Sales    1000
Name: FB, dtype: int64

In [6]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [7]:
#Displays person name as well, python displays the max string in the person section as well
df.groupby("Company").max()

        Person  Sales
Company
FB        Viha    650
GOOG       Anu    200
MSFT       Rek    340

In [8]:
df.groupby("Company").min()

        Person  Sales
Company
FB       Krish    350
GOOG     Adhin    120
MSFT      Diya    124

In [9]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  500.0  212.132034  350.0  425.0  500.0  575.0  650.0
GOOG      2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

# DataFrames - Joins

In [10]:
import numpy as np
import pandas as pd
dic1 ={'A':['A0','A1','A2'],
       'B': ['B0','B1','B2'],
       'index':['K0','K1','K2']
      }
dic2 = {'C':['C0','C1','C2'],
       'D': ['D0','D1','D2'],
       'index':['K0','K2','K3']
      }

left = pd.DataFrame(dic1)
right = pd.DataFrame(dic2)

In [11]:
print(left)
print(right)

    A   B index
0  A0  B0    K0
1  A1  B1    K1
2  A2  B2    K2
    C   D index
0  C0  D0    K0
1  C1  D1    K2
2  C2  D2    K3

In [12]:
pd.merge(left,right,how="inner",on="index")

    A   B index   C   D
0  A0  B0    K0  C0  D0
1  A2  B2    K2  C1  D1

In [13]:
pd.merge(left,right,how="inner", on="index")['C']

0    C0
1    C1
Name: C, dtype: object

In [14]:
pd.merge(left,right,how="left", on="index")

    A   B index    C    D
0  A0  B0    K0   C0   D0
1  A1  B1    K1  NaN  NaN
2  A2  B2    K2   C1   D1

In [15]:
pd.merge(left,right,how="right", on="index")

     A    B index   C   D
0   A0   B0    K0  C0  D0
1   A2   B2    K2  C1  D1
2  NaN  NaN    K3  C2  D2

In [16]:
pd.concat([left,right])

     A    B index    C    D
0   A0   B0    K0  NaN  NaN
1   A1   B1    K1  NaN  NaN
2   A2   B2    K2  NaN  NaN
0  NaN  NaN    K0   C0   D0
1  NaN  NaN    K2   C1   D1
2  NaN  NaN    K3   C2   D2

In [17]:
pd.concat([left,right], axis=1)

    A   B index   C   D index
0  A0  B0    K0  C0  D0    K0
1  A1  B1    K1  C1  D1    K2
2  A2  B2    K2  C2  D2    K3

# DataFrames - unique, value_counts, sort_values, isnull, lambda, Pivot

In [18]:
import numpy as np
import pandas as pd
df= pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df['col2'].unique

<bound method Series.unique of 0    444
1    555
2    666
3    444
Name: col2, dtype: int64>

In [20]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [21]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [22]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [23]:
def times2(x):
    return x*2
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [24]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [25]:
data = {
    'A' :['foo', 'foo', 'foo','bar','bar','bar'],
    'B' :['one','one','two','two','one','one'],
    'C' :['x','y','x','y','x','y'],
    'D' :[1,3,2,5,4,1]
}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [26]:
df.pivot_table(values='D', index=['A','B'])

           D
A   B
bar one  2.5
    two  5.0
foo one  2.0
    two  2.0